resources/testplans/mongodb/TestPlan-MongoDB-GridFSRead-WithConn.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9 r1437961">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="MongoDB-Random-GFSRead-1000-1000-1" enabled="true">
      <boolProp name="TestPlan.functional_mode">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="testPlanName" elementType="Argument">
            <stringProp name="Argument.name">testPlanName</stringProp>
            <stringProp name="Argument.value">RENAME-THIS</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfThreads" elementType="Argument">
            <stringProp name="Argument.name">numberOfThreads</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
            <stringProp name="Argument.desc">The number of threads.</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="rampUpTime" elementType="Argument">
            <stringProp name="Argument.name">rampUpTime</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Ramp up time [sec]</stringProp>
          </elementProp>
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">node1.cern.ch</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Host to connect to.</stringProp>
          </elementProp>
          <elementProp name="controller" elementType="Argument">
            <stringProp name="Argument.name">controller</stringProp>
            <stringProp name="Argument.value">cloud-jmeter.cern.ch</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <assignment.AssignmentConfigElement guiclass="TestBeanGUI" testclass="assignment.AssignmentConfigElement" testname="Custom - Assignment Configuration" enabled="true">
        <stringProp name="assignmentFile">unspecified</stringProp>
        <stringProp name="assignmentInfo">assignInfo</stringProp>
        <stringProp name="assignmentMode">random</stringProp>
        <stringProp name="binaryInfo">binInfo</stringProp>
        <stringProp name="inputLocation">/mnt/testdata/</stringProp>
        <stringProp name="encoding">binary</stringProp>
        <stringProp name="numberOfAssignments">${numberOfThreads}</stringProp>
      </assignment.AssignmentConfigElement>
      <hashTree/>
      <mongodb.MongoConfigElement guiclass="TestBeanGUI" testclass="mongodb.MongoConfigElement" testname="Custom - MongoDB Connection Configuration" enabled="false">
        <stringProp name="autoConnectRetry">False</stringProp>
        <stringProp name="connectTimeout">0</stringProp>
        <stringProp name="connectionsPerHost">100</stringProp>
        <stringProp name="database">conddb</stringProp>
        <stringProp name="host">${host}</stringProp>
        <stringProp name="maxAutoConnectRetryTime">0</stringProp>
        <stringProp name="maxWaitTime">120000</stringProp>
        <stringProp name="password">testPass</stringProp>
        <stringProp name="port">27017</stringProp>
        <stringProp name="socketKeepAlive">True</stringProp>
        <stringProp name="socketTimeout">0</stringProp>
        <stringProp name="threadsAllowedToBlockMultiplier">5</stringProp>
        <stringProp name="username">testUser</stringProp>
        <stringProp name="connectionId">mongoConn</stringProp>
      </mongodb.MongoConfigElement>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Iperf" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1392294966000</longProp>
        <longProp name="ThreadGroup.end_time">1392294966000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <SystemSampler guiclass="SystemSamplerGui" testclass="SystemSampler" testname="Iperf Sampler" enabled="false">
          <boolProp name="SystemSampler.checkReturnCode">true</boolProp>
          <stringProp name="SystemSampler.expectedReturnCode">0</stringProp>
          <stringProp name="SystemSampler.command">iperf</stringProp>
          <elementProp name="SystemSampler.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">-c</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">${host}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">-t 1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="" elementType="Argument">
                <stringProp name="Argument.value">-P 10</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <elementProp name="SystemSampler.environment" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SystemSampler.stdout">./${testPlanName}/iperflog_${__threadNum}_${__machineName}_to_${host}.log</stringProp>
          <stringProp name="SystemSampler.stderr">./${testPlanName}/iperflog_${__threadNum}_${__machineName}_to_${host}.log</stringProp>
        </SystemSampler>
        <hashTree>
          <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">./RENAME-THIS/iperfSampleResults.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Start Monitoring" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1411742528000</longProp>
        <longProp name="ThreadGroup.end_time">1411742528000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler" testname="SSH DSTAT" enabled="true">
          <stringProp name="command">timeout ${rampUpTime} dstat -T -c -d -r -g -i -l -m -n -s -p -y --fs --ipc --lock --raw --socket --tcp --udp --unix --vm --nocolor --output ~/dstat.csv &gt; /dev/null &amp;</stringProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="hostname">${host}</stringProp>
          <stringProp name="password">testPass</stringProp>
          <intProp name="port">22</intProp>
          <boolProp name="printStdErr">true</boolProp>
          <boolProp name="useReturnCode">true</boolProp>
          <stringProp name="username">testUser</stringProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler>
        <hashTree/>
        <org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler" testname="SSH IOSTAT" enabled="true">
          <stringProp name="command">iostat -cdxtm /dev/vda 1 ${rampUpTime} &gt; ~/iostat.csv &amp;</stringProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="hostname">${host}</stringProp>
          <stringProp name="password">testPass</stringProp>
          <intProp name="port">22</intProp>
          <boolProp name="printStdErr">true</boolProp>
          <boolProp name="useReturnCode">true</boolProp>
          <stringProp name="username">testUser</stringProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">./RENAME-THIS/monitoring/MonitoringThreadsStart.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="QueryHandlers" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${numberOfThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampUpTime}</stringProp>
        <longProp name="ThreadGroup.start_time">1385029359000</longProp>
        <longProp name="ThreadGroup.end_time">1385029359000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <mongodb.MongoConnectionSampler guiclass="TestBeanGUI" testclass="mongodb.MongoConnectionSampler" testname="Custom - MongoDB Connection Sampler" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionId">mongoConn-${__threadNum}</stringProp>
          <stringProp name="connectionsPerHost">10</stringProp>
          <stringProp name="database">conddb</stringProp>
          <stringProp name="host">${host}</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">False</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">5</stringProp>
          <stringProp name="username">testUser</stringProp>
        </mongodb.MongoConnectionSampler>
        <hashTree>
          <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">./RENAME-THIS/MongoConnectionOpenSamplerResults.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <mongodb.MongoSampler guiclass="TestBeanGUI" testclass="mongodb.MongoSampler" testname="Custom - MongoDB Sampler" enabled="true">
          <stringProp name="assignmentInfo">assignInfo</stringProp>
          <stringProp name="gridFsMethod">True</stringProp>
          <stringProp name="useChunks">False</stringProp>
          <stringProp name="connectionId">mongoConn-${__threadNum}</stringProp>
          <stringProp name="requestType">read</stringProp>
          <stringProp name="validateOperation">False</stringProp>
        </mongodb.MongoSampler>
        <hashTree>
          <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">./RENAME-THIS/MongoQueryHandlerSampleResults.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <mongodb.MongoConnectionSampler guiclass="TestBeanGUI" testclass="mongodb.MongoConnectionSampler" testname="Custom - MongoDB Connection Sampler" enabled="true">
          <stringProp name="autoConnectRetry">False</stringProp>
          <stringProp name="connectTimeout">0</stringProp>
          <stringProp name="connectionId">mongoConn-${__threadNum}</stringProp>
          <stringProp name="connectionsPerHost">10</stringProp>
          <stringProp name="database">conddb</stringProp>
          <stringProp name="host">${host}</stringProp>
          <stringProp name="maxAutoConnectRetryTime">0</stringProp>
          <stringProp name="maxWaitTime">120000</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="port">27017</stringProp>
          <stringProp name="socketKeepAlive">False</stringProp>
          <stringProp name="socketTimeout">0</stringProp>
          <stringProp name="threadsAllowedToBlockMultiplier">5</stringProp>
          <stringProp name="username">testUser</stringProp>
        </mongodb.MongoConnectionSampler>
        <hashTree>
          <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">./RENAME-THIS/MongoConnectionCloseSamplerResults.csv</stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Finish monitoring" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1411742723000</longProp>
        <longProp name="ThreadGroup.end_time">1411742723000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler" testname="SSH SFTP Copy DSTAT" enabled="true">
          <stringProp name="action">get</stringProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="destination">./RENAME-THIS/monitoring/dstat.csv</stringProp>
          <stringProp name="hostname">${host}</stringProp>
          <stringProp name="password">testPass</stringProp>
          <intProp name="port">22</intProp>
          <boolProp name="printFile">false</boolProp>
          <stringProp name="source">/home/testUser/dstat.csv</stringProp>
          <stringProp name="username">testUser</stringProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler>
        <hashTree/>
        <org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler" testname="SSH SFTP Copy IOSTAT" enabled="true">
          <stringProp name="action">get</stringProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="destination">./RENAME-THIS/monitoring/iostat.csv</stringProp>
          <stringProp name="hostname">${host}</stringProp>
          <stringProp name="password">testPass</stringProp>
          <intProp name="port">22</intProp>
          <boolProp name="printFile">false</boolProp>
          <stringProp name="source">/home/testUser/iostat.csv</stringProp>
          <stringProp name="username">testUser</stringProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler>
        <hashTree/>
        <org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler" testname="SSH Remove" enabled="true">
          <stringProp name="hostname">${host}</stringProp>
          <intProp name="port">22</intProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="username">testUser</stringProp>
          <stringProp name="password">testPass</stringProp>
          <stringProp name="command">rm ~/*</stringProp>
          <boolProp name="useReturnCode">true</boolProp>
          <boolProp name="printStdErr">true</boolProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHCommandSampler>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">./RENAME-THIS/monitoring/MonitoringThreadsStop.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>